___

<a href='https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.groupby.html'> <img src='https://www.python.org/static/img/python-logo.png' /></a>
___

# Groupby

El método **groupby** le permite agrupar filas de datos y llamar a funciones agregadas

In [35]:
import pandas as pd
# Creamos un dataframe
data = {'Empresa':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Persona':['Luis','Juan','Oscar','Rosa','Jorge','Esteban'],
       'Edad':[20, 14, 15, 19, 25, 11],
       'Ventas':[100,140,340,124,243,350]}

In [37]:
df = pd.DataFrame(data)

In [38]:
df

  Empresa  Persona  Edad  Ventas
0    GOOG     Luis    20     100
1    GOOG     Juan    14     140
2    MSFT    Oscar    15     340
3    MSFT     Rosa    19     124
4      FB    Jorge    25     243
5      FB  Esteban    11     350

**Ahora se puede usar el método .groupby () para agrupar filas basándose en el nombre de una columna. Por ejemplo, agrupemos en función de la empresa. Esto creará un objeto DataFrameGroupBy:**

In [39]:
df.groupby('Empresa')

Puedes guardar este objeto como una nueva variable:

In [40]:
by_emp = df.groupby("Empresa")

Y luego llamar a los métodos agregados fuera del objeto:

In [41]:
by_emp.mean()

         Edad  Ventas
Empresa
FB       18.0   296.5
GOOG     17.0   120.0
MSFT     17.0   232.0

In [31]:
df.groupby('Empresa').mean()

         Edad  Ventas
Empresa
FB       18.0   296.5
GOOG     17.0   110.0
MSFT     17.0   232.0

Más ejemplos de métodos agregados:

In [32]:
by_emp.std()

             Edad      Ventas
Empresa
FB       9.899495   75.660426
GOOG     4.242641   14.142136
MSFT     2.828427  152.735065

In [42]:
by_emp.min()

         Persona  Edad  Ventas
Empresa
FB       Esteban    11     243
GOOG        Juan    14     100
MSFT       Oscar    15     124

In [34]:
by_emp.max()

        Persona  Edad  Ventas
Empresa
FB        Jorge    25     350
GOOG       Luis    20     120
MSFT       Rosa    19     340

In [43]:
by_emp.count()

         Persona  Edad  Ventas
Empresa
FB             2     2       2
GOOG           2     2       2
MSFT           2     2       2

In [11]:
by_emp.describe()

        Ventas
         count   mean         std    min     25%    50%     75%    max
Empresa
FB         2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG       2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT       2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [44]:
by_emp.describe().transpose()

Empresa               FB        GOOG        MSFT
Edad   count    2.000000    2.000000    2.000000
       mean    18.000000   17.000000   17.000000
       std      9.899495    4.242641    2.828427
       min     11.000000   14.000000   15.000000
       25%     14.500000   15.500000   16.000000
       50%     18.000000   17.000000   17.000000
       75%     21.500000   18.500000   18.000000
       max     25.000000   20.000000   19.000000
Ventas count    2.000000    2.000000    2.000000
       mean   296.500000  120.000000  232.000000
       std     75.660426   28.284271  152.735065
       min    243.000000  100.000000  124.000000
       25%    269.750000  110.000000  178.000000
       50%    296.500000  120.000000  232.000000
       75%    323.250000  130.000000  286.000000
       max    350.000000  140.000000  340.000000

In [45]:
by_emp.describe().transpose()['GOOG']

Edad    count      2.000000
        mean      17.000000
        std        4.242641
        min       14.000000
        25%       15.500000
        50%       17.000000
        75%       18.500000
        max       20.000000
Ventas  count      2.000000
        mean     120.000000
        std       28.284271
        min      100.000000
        25%      110.000000
        50%      120.000000
        75%      130.000000
        max      140.000000
Name: GOOG, dtype: float64

# Buen trabajo!